package algoritmization.decompositionUsingMethods;

/*Написать метод(методы) для нахождения наибольшего общего
 делителя четырех натуральных чисел.
 */
public class Task4_2 {
    public static void main(String[] args) {

        System.out.println(DecompositionMethods.divisorOfNumbers(12,4,24,8));
    }
}
