package algoritmization.decompositionUsingMethods;

/*Написать метод(методы), определяющий,
в каком из данных двух чисел больше цифр.
 */
public class Task4_11 {
    public static void main(String[] args) {

        final int a = 1234;
        final double b = 123.45;
        System.out.println(DecompositionMethods.longestNumber(a,b).toString());
    }
}
