package algoritmization.decompositionUsingMethods;

/*Написать метод(методы) для вычисления суммы
факториалов всех нечетных чисел от 1 до 9.
 */
public class Task4_7 {
    public static void main(String[] args) {

        System.out.println(DecompositionMethods.sumOfFactorials(1,3,5,7,9));
    }
}
