package algoritmization.decompositionUsingMethods;

/*Даны числа X, Y, Z, Т — длины сторон четырехугольника.
Написать метод(методы) вычисления его площади,
если угол между сторонами длиной X и Y— прямой.
 */
public class Task4_9 {
    public static void main(String[] args) {
        System.out.println(DecompositionMethods.quadrangleAreaBySides(2,2,2,7));
    }
}
