package algoritmization.decompositionUsingMethods;

/* Написать метод(методы) для нахождения наибольшего общего
 делителя и наименьшего общего кратного двух натуральных чисел:
 */
public class Task4_1 {
    public static void main(String[] args) {
        System.out.println(DecompositionMethods.commonMultipleOrDivider(160, 16, false));
    }
}
