package stringsAndBasicsOfTextProcessing.WorkingWithAStringAsAStringOrStringBuilder;

/* Вводится строка слов, разделенных пробелами.
Найти самое длинное слово и вывести его на экран.
Случай, когда самых длинных слов может быть несколько, не обрабатывать.
 */
public class Task2_8 {
    public static void main(String[] args) {
        System.out.println(WorkingWithStringsMethods.showTheFirstLargestWord("Word Words Words sout sout i"));
    }
}
